AcRxMemberQueryEngine.removeReactor(AcRxMemberReactor*)
Removes AcRxMemberReactor reactor
pReactor:
Input AcRxMemberReactor to remove

AcRxMemberQueryEngine.addReactor(AcRxMemberReactor*)
Adds AcRxMemberReactor reactor
pReactor:
Input AcRxMemberReactor to add

AcRxMemberQueryEngine.removeFacetProvider(AcRxFacetProvider*)
This method can be be used to remove a facet provider.
pProvider:
Input facet provider that is to be removed.
Returns:  Returns Acad::eOk if successful; otherwise, returns an AutoCAD error status.

AcRxMemberQueryEngine.addFacetProvider(AcRxFacetProvider*)
This method can be be used to add a facet provider.
pProvider:
Input facet provider that is to be added.
Returns:  Returns Acad::eOk if successful; otherwise, returns an AutoCAD error status.

AcRxMemberQueryEngine.promotingContext
This method can be used to query the promotingContext that can be
used to query for members. The promoting context can be used when
certain members need to be promoted with respect to certain other
members. For example using the promoting context we can get
three promoted members Start X, Start Y and Start Z, instead of
a StartPoint member.
Returns:
Returns pointer to AcRxPromotingQueryContext.

AcRxMemberQueryEngine.defaultContext
This method can be used to query the defaultContext that can be
used to query for members.
Returns:
Returns pointer to AcRxMemberQueryContext.

AcRxMemberQueryEngine.newMemberIterator(AcRxObject!System.Runtime.CompilerServices.IsConst*,AcRxMemberQueryContext!System.Runtime.CompilerServices.IsConst*)
This method can be used to get the members of an object.
pO:
Input object to query for members.
pContext:
Optional. Input the context data that is used to query the members.
Returns:
Returns pointer to AcRxMemberIterator if there are members, otherwise returns NULL.

AcRxMemberQueryEngine.find(AcRxObject!System.Runtime.CompilerServices.IsConst*,System.Char!System.Runtime.CompilerServices.IsConst*,AcRxMemberQueryContext!System.Runtime.CompilerServices.IsConst*)
This method can be used to find an AcRxMember of an object using the name.
pO:
Input object that need to be searched for the member.
name:
Input the name of the member to find.
pContext:
Optional. Input the context data that is used to query the member.
Returns:
Returns pointer to an AcRxMember if successful, otherwise returns NULL.

AcRxMemberQueryEngine.theEngine
Returns the singleton object
Returns:
Returns pointer to an AcRxMemberQueryEngine if successful, otherwise returns NULL.

AcRxMemberQueryEngine
The AcRxMemberQueryEngine object is used to query the members and register the
facet providers. This class is a singleton with a static method that returns
a global instance of the object.